example = 'Топинамбур' # 1. В переменную example запишите любую строку.

print(example[0]) # 2. Выведите на экран(в консоль) первый символ этой строки.

print(example[-1]) # 3. Выведите на экран(в консоль) последний символ этой строки (используя отрицательный индекс).

print(example[5:]) # 4. Выведите на экран(в консоль) вторую половину этой строки (С нечётным количеством символов: 'Urban' -> 'ban').

print(example[::-1]) # 5. Выведите на экран(в консоль) это слово наоборот.

print(example[1:10:2]) # 6. Выведите на экран(в консоль) каждый второй символ этой строки. (Пример: 'Топинамбур'->'оиабр')

# Если нужно было реально любое слово написать, то переделаю, а то просто под скрином в задании вводные данные и дано это слово :)